// приведеня до булю на прикладі 

// Boolean();

// console.dir(Boolean);
// console.dir(Number);
// console.dir(Array);
// console.dir(String);

// логічне Та (оператор and) запанається не неправдіб або якщо всі умови тру вертає останє тру

console.log(5 && 1 && "Mango");
console.log(0 && 7 && 9 && "Mango");
console.log("Mango" && 12 && NaN && "");

// логічне "або" (оператор ||) вертає перше тру, якщо тру немає то вертається останій фолс

console.log(false || null || 5 || 0);
console.log(false || null || "" || 0);

// логічне "не" (оператор !), робить інверсію з правди на неправду

console.log(!NaN);
console.log(!null);
console.log(!"Mango");

// оператор розгалуженя if 

if (5 > 10) {
    console.log("Так ви праві")
}

// const userName = prompt("Вгадайте імя");

// оператор розгалуженя if ... else

// if (userName.toLocaleLowerCase() === "Вася".toLocaleLowerCase()){
//     alert("Ви вгадали")
// } else{
//     alert("Ви не вгадали")
// }

// оператор розгалуженя else ... if  

// const userSalary = prompt("Ваша зарплата");

// if (userSalary < 500){
// alert("you are trainee front-end developer")
// }else if (userSalary < 1300){
//     alert("you are junior front-end developer")
// }else if(userSalary < 3000){
//     alert("you are middle front-end developer")
// }else{
//     alert("you are senior front-end developer")
// }

// тернарний оператор

/* <умова> ? <вираз_якщо_умова_правдива> : 
<вираз_якщо_умова_хибна></вираз_якщо_умова_хибна> */

// const userName = prompt("Вгадайте імя");

// const response = userName.toLocaleLowerCase() === "Вася".toLocaleLowerCase() ? alert("Ви вгадали") : alert("Ви не вгадали");

// Баланс користувача зберігається в змінній balance
//  - Сума покупки зберігається в змінній payment
// - Перед перевіркою вивести повідомлення:
//  «Загальная вартість замовлення [число] кредитів. Перевіряємо кіл-ть доступних грошей на рахунку

//  * - Якщо сума покупки не перевищує баланс:
//  *    - Вирахувати з балансу суму покупки
//  *    - Вивести повідомлення «На рвхунку залишилось [число] кредитів»
//  * - Якщо сума покупки перевищує баланс:
//  *    - Вивести повідомлення «На рахунку недостатньо грошей для проведення операції!»
//  * - В кінці вивести повідомлення «Операція завершена»

// let balance = 1000;

// const payment = prompt("На скільки кредиті ви бажаєте купити товару");

// alert(`Загальная вартість замовлення ${payment} кредитів. Перевіряємо кіл-ть доступних грошей на рахунку`)

// if (payment < balance) {
//     balance = balance - payment
//     balance -= payment
//     alert(`На рвхунку залишилось ${balance} кредитів`)
// } else {
//     alert(`На рахунку недостатньо грошей для проведення операції!`)
// }

// alert("Операція завершена");



// Напиши скрит підрахунку вартості покупки зі знижкою в залежності від потраченої суми за весь час (партнерська програма).
// - Загальна сума випотраченого зберігається в змінній totalSpent
// - Сума поточного платежу зберігається в змінній payment
//  - Скидка зберігається в змінній discount
//  - Якщо витрачено від [100 до 1000) - бронзовий партнер, скидка 2%
//  - Якщо витрачено від [1000 до 5000) - срібний партнер, скидка 5%
//  - Якщо витрачено більше [5000 - золотий партнер, скидка 10%
//  - Якщо витрачено менше 100) - не партнер, скидка 0%
//  - В результаті вивести повідомлення
//  «Оформляємо замовлення на суму [сума] зі знижкою [знижка]%»

// const payment = prompt("На скільки кредиті ви бажаєте купити товару");

// let discount;

// if (100 < payment < 1000){
//     discount = 2
// } else if (1000 < payment < 5000){
//     discount = 5
// } else if (5000 < payment){
//     discount = 10
// } else {
//     discount = 0
// }

// discount = discount * payment / 100;

 // discount *= payment / 100;

// const totalSpent = payment - discount;

// alert(`Оформляємо замовлення на суму ${totalSpent} зі знижкою ${discount}%`);



// Напиши скрипт виблру вартості готелю по кількості зірок.
//  * 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
//  *
//  * Якщо у змінній stars є ще інші цифри, крім 1-5, виведи рядок "Такої кількості зірок готелю не існує"

// const stars = Number(prompt("скількі зірок має бути в готелю"));

// let price;

// if (stars === 1) {
//     price = 20
// } else if (stars === 2){
//     price = 30
// } else if (stars === 3){
//     price = 50
// } else if (stars === 4){
//     price = 70
// } else if (stars === 5){
//     price = 120
// } else{
//     alert("Такої кількості зірок готелю не існує")
// }

// alert(price);


// switch (stars) {
//     case 1 :
//         price = 20;
//         break;

//     case 2 :
//         price = 30; 
//         break;

//     case 3 :
//         price = 50; 
//          break;

//     case 4 :
//         price = 70; 
//         break;

//     case 5 :
//         price = 120; 
//         break;

//     default :
//            alert("Такої кількості зірок готелю не існує")
// }



// Напиши скрипт вибору вартості готелю по кількості зірок.
//  1,2 - 20$, 3,4 - 30$, 5 - 120$

// const stars = Number(prompt("скількі зірок має бути в готелю"));

// let price;

// if (stars === 1 || stars === 2) {
//         price = 20
//     } else if (stars === 3 || stars === 4){
//         price = 30
//     } else if (stars === 5){
//         price = 120
//     } else{
//         alert("Такої кількості зірок готелю не існує")
//     }

//     alert(price);

// switch (stars) {
//     case 1 :
//     case 2 :
//         price = 20;
//         break;

//     case 3 :
//     case 4 :
//         price = 50; 
//          break;

//     case 5 :
//         price = 120; 
//         break;

//     default :
//            alert("Такої кількості зірок готелю не існує")
// }



//     * Напиши скрипт вибору опції доставки товару.
//  * Опція зберігається в змінній option: 1 - самовивіз, 2 - курʼєр, 3 - пошта
//  *
//  * В змінну message записати повідомлення в залежності від опції.
//  * - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
//  * - 'Курʼєр доставить замовлення завтра з 9:00 до 18:00'
//  * - 'Посилка буде відправлена сьогодні'
//  * - 'Вам перезвонить менеджер'


// switch (значення) {
//     case значення:
//       інструкції;
//       break;
  
//     case значення:
//       інструкції;
//       break;
  
//     default:
//       інструкції;
//   }


// const option = Number(prompt("Оберіть спосіб доставки"));

// if (option === 1) {
//     alert('Ви зможете забрати товар завтра з 12:00 в нашому офісі')
// } else if (option === 2) {
//     alert('Курʼєр доставить замовлення завтра з 9:00 до 18:00')
// } else if (option === 3) {
//     alert('Посилка буде відправлена сьогодні')
// } else {
//     alert('Вам перезвонить менеджер')
// }

// switch (option) {
// case 1 :
//     alert('Ви зможете забрати товар завтра з 12:00 в нашому офісі');
//     break;

// case 2 : 
//     alert('Курʼєр доставить замовлення завтра з 9:00 до 18:00');
//     break;

// case 3 :
//     alert('Посилка буде відправлена сьогодні');
//     break;

// default:
//     alert('Вам перезвонить менеджер')
// }



